zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v4.c
/***************************************************************************//**
* \file cy_syspm_v4.c
* \version 5.220
*
* This driver provides the source code for API power management.
*
********************************************************************************
* \copyright
* (c) 2016-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"
#include "cy_sysclk.h"

#if defined (CY_IP_MXS22SRSS)

#include "cy_syspm.h"
#include "cy_syspm_ppu.h"
#include "cy_rram.h"
#include "cy_ipc_sema.h"
#if defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1)
#include "cy_secure_services.h"
#endif
/*******************************************************************************
*       Internal Functions
*******************************************************************************/


/*******************************************************************************
*       Internal Defines
*******************************************************************************/

/* The define for number of callback roots */
#define CALLBACK_ROOT_NR                (8U)

/* The mask to unlock the Hibernate power mode */
#define HIBERNATE_UNLOCK_VAL                 ((uint32_t) 0x3Au << SRSS_PWR_HIBERNATE_UNLOCK_Pos)

/* The mask to set the Hibernate power mode */
#define SET_HIBERNATE_MODE                   ((HIBERNATE_UNLOCK_VAL |\
                                               SRSS_PWR_HIBERNATE_FREEZE_Msk |\
                                               SRSS_PWR_HIBERNATE_HIBERNATE_Msk))

/* The mask to retain the Hibernate power mode status */
#define HIBERNATE_RETAIN_STATUS_MASK         ((SRSS_PWR_HIBERNATE_TOKEN_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk |\
                                               SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk))

/** The mask for the Hibernate wakeup sources */
#define HIBERNATE_WAKEUP_MASK               ((SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_SRC_Msk |\
                                              SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_CSV_BAK_Msk |\
                                              SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_RTC_Msk |\
                                              SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_WDT_Msk))

/** The define to update the token to indicate the transition into Hibernate */
#define HIBERNATE_TOKEN                    ((uint32_t) 0x1BU << SRSS_PWR_HIBERNATE_TOKEN_Pos)

/* The wait time for transition into the minimum regulator current mode
*/
#define SET_MIN_CURRENT_MODE_DELAY_US        (1U)

/* The wait delay time that occurs before the active reference is settled.
*  Intermediate delay is used in transition into the normal regulator current
*  mode, it should be two IHO cycles, which is (2 x 1/50000000)
*  = 1 micro second(Approximated)
*/
#define ACT_REF_SETTLE_DELAY_US              (1U)

/* The wait delay time that occurs after the active reference is settled.
*  Final delay is used in transition into the normal regulator current mode
*/
#define SET_NORMAL_CURRENT_MODE_DELAY_US     (1U)

/* The internal define of the tries number in the
* Cy_SysPm_SystemSetMinRegulatorCurrent() function
*/
#define WAIT_DELAY_TRIES                (100U)

/* The internal define of the tries number in the
* CoreBuck and LDO status functions
*/
#define CY_SYSPM_CBUCK_BUSY_RETRY_COUNT         (100000U)
#define CY_SYSPM_CBUCK_BUSY_RETRY_DELAY_US      (1U)

/* SRAM TRIM Values
*/
#define RAM_TRIM_VAL_A      0x0000000AU
#define RAM_TRIM_VAL_B      0x0000000BU
#define RAM_TRIM_VAL_C      0x0000000CU
#define RAM_TRIM_VAL_F      0x0000000FU
#define RAM_TRIM_VAL_1B     0x0000001BU
#define RAM_TRIM_VAL_2D     0x0000002DU
#define RAM_TRIM_VAL_3F     0x0000003FU
#define RAM_TRIM_VAL_202    0x00000202U
#define RAM_TRIM_VAL_203    0x00000203U
#define RAM_TRIM_VAL_204    0x00000204U
#define RAM_TRIM_VAL_206    0x00000206U
#define RAM_TRIM_VAL_207    0x00000207U
#define RAM_TRIM_VAL_20A    0x0000020AU
#define RAM_TRIM_VAL_20B    0x0000020BU
#define RAM_TRIM_VAL_20C    0x0000020CU
#define RAM_TRIM_VAL_20F    0x0000020FU
#define RAM_TRIM_VAL_21A    0x0000021AU
#define RAM_TRIM_VAL_21B    0x0000021BU
#define RAM_TRIM_VAL_21F    0x0000021FU
#define RAM_TRIM_VAL_22D    0x0000022DU
#define RAM_TRIM_VAL_23D    0x0000023DU
#define RAM_TRIM_VAL_23F    0x0000023FU
#define RAM_TRIM_VAL_342    0x00000342U
#define RAM_TRIM_VAL_343    0x00000343U
#define RAM_TRIM_VAL_603    0x00000603U
#define RAM_TRIM_VAL_604    0x00000604U
#define RAM_TRIM_VAL_605    0x00000605U
#define RAM_TRIM_VAL_606    0x00000606U
#define RAM_TRIM_VAL_607    0x00000607U
#define RAM_TRIM_VAL_60B    0x0000060BU
#define RAM_TRIM_VAL_60C    0x0000060CU
#define RAM_TRIM_VAL_60D    0x0000060DU
#define RAM_TRIM_VAL_60F    0x0000060FU
#define RAM_TRIM_VAL_61B    0x0000061BU
#define RAM_TRIM_VAL_61C    0x0000061CU
#define RAM_TRIM_VAL_61D    0x0000061DU
#define RAM_TRIM_VAL_61F    0x0000061FU
#define RAM_TRIM_VAL_62D    0x0000062DU
#define RAM_TRIM_VAL_63D    0x0000063DU
#define RAM_TRIM_VAL_63F    0x0000063FU
#define RAM_TRIM_VAL_743    0x00000743U
#define RAM_TRIM_VAL_E1F    0x00000E1FU
#define RAM_TRIM_VAL_E3F    0x00000E3FU
#define RAM_TRIM_VAL_1E3F   0x00001E3FU

/* Clock HF macros */
#define SYSPM_CLOCK_HF0_INDEX  0U
#define SYSPM_CLOCK_HF1_INDEX  1U
#define SYSPM_CLOCK_HF10_INDEX 10U

