zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v4.c
    /* 4) SRAM trim updates - LP->HP(2) through LP->HP(5) */
    /* LP->HP(2) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_606);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_606);

    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_606);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_606);

    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_23F);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_23F);

    /* LP->HP(3) */
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_607);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_607);

    /* LP->HP(4) */
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_60F);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_60F);

    /* LP->HP(5) */
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_20F);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_20F);

    /* 5) Change the voltage */
    Cy_SysPm_CoreBuckSetProfile(CY_SYSPM_CORE_BUCK_PROFILE_HP);

    if(CY_SYSPM_SUCCESS != Cy_SysPm_CoreBuckStatus())
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        Cy_SysPm_SramLdoSetVoltage(CY_SYSPM_SRAMLDO_VOLTAGE_0_90V);
        retVal = Cy_SysPm_SramLdoEnable(true);

        if(CY_SYSPM_SUCCESS != retVal)
        {
            retVal = CY_SYSPM_FAIL;
        }
        else
        {
            /* 6) SRAM trim updates - LP->HP(7) & LP->HP(8) */
            /* LP->HP(7) */
            Cy_SysPm_SetTrimRamCtl(0U, RAM_TRIM_VAL_343);
            Cy_SysPm_SetTrimRamCtl(1U, RAM_TRIM_VAL_343);

            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_206);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_206);

            Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_3F);
            Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_3F);

            Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_A);

            /* LP->HP(8) */
            Cy_SysPm_SetTrimRamCtl(0U, RAM_TRIM_VAL_342);
            Cy_SysPm_SetTrimRamCtl(1U, RAM_TRIM_VAL_342);

            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_202);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_202);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_20B);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_20B);

            Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_1B);
            Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_1B);

            /* 7) M33 send IPC to m0seccpuss - Voltage at target level */
            //TBD

            /* 8) Change RRAM to LP mode  */
            /* Moved to callback */

            /* 9) Change Frequency  */
            /* Frequency Change needs to be done after calling this API */

            /* 10) M33 sends IPC to m0seccpuss - Frequency at target level */
            //TBD
        }
    }


    return retVal;
}

static cy_en_syspm_status_t Cy_SysPm_SystemEnterUlpToLp(void)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* ULP to LP Sequence */

    /* 1) M33 send IPC to m0seccpuss - Operating mode change target */
    //TBD

    /* 2) Retention Level change */
    //TBD

    /* 3) ULP->LP(1), Reduce frequency by at least 18% (50MHz to <= 41MHz) for SRAM timing margin */
    /* Frequency Reduction needs to be done before calling this API */

    /* 4) SRAM trim updates - ULP->LP(3) through ULP->LP(5) */
    /* ULP->LP(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_607);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_607);

    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_607);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_607);

    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_63D);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_63D);

    Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_F);

    /* ULP->LP(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_606);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_606);

    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_606);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_606);

    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_62D);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_62D);

    Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_B);

    /* ULP->LP(5) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_604);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_604);

    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_604);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_604);

    /* 5) Change the voltage */
    Cy_SysPm_CoreBuckSetProfile(CY_SYSPM_CORE_BUCK_PROFILE_LP);

    if(CY_SYSPM_SUCCESS != Cy_SysPm_CoreBuckStatus())
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        /* 5.1 Disable the SRAMLDO allowing CBUCK to supply SRAM Core */
        retVal = Cy_SysPm_SramLdoEnable(false);

        if(CY_SYSPM_SUCCESS != retVal)
        {
            retVal = CY_SYSPM_FAIL;
        }
        else
        {
            /* 6) SRAM trim updates - ULP->LP(7) */
            Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_22D);
            Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_22D);

            /* 7) M33 send IPC to m0seccpuss - Voltage at target level */
            //TBD

           /* 8) Change RRAM to LP mode  */
           /* Moved to callback */

            /* 9) Change Frequency  */
            /* Frequency Change needs to be done after calling this API */

            /* 10) M33 sends IPC to m0seccpuss - Frequency at target level */
            //TBD
        }
    }
    return retVal;
}

static cy_en_syspm_status_t Cy_SysPm_SystemEnterLpToUlp(void)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* LP to ULP Sequence */

    /* 1) M33 send IPC to m0seccpuss - Operating mode change target */
    //TBD

    /* 2) Retention Level change */
    //TBD

    /* 3) Reduce the operating frequency so it is at least 66% (120MHz to 41MHz) */
    /* Frequency Reduction needs to be done before calling this API */

    /* LP->ULP(2) */
    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_23D);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_23D);

    Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_F);

    /* LP->ULP(3) */
    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_63D);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_63D);

    /* 5) Change the voltage */
    /* 5.1 Enable the SRAMLDO to supply SRAM Core  */
    retVal = Cy_SysPm_SramLdoEnable(true);

    if(CY_SYSPM_SUCCESS != retVal)
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        /* 5.2 Select the ULP voltage profile */
        Cy_SysPm_CoreBuckSetProfile(CY_SYSPM_CORE_BUCK_PROFILE_ULP);

        if(CY_SYSPM_SUCCESS != Cy_SysPm_CoreBuckStatus())
        {
            retVal = CY_SYSPM_FAIL;
        }
        else
        {
            /* 6) SRAM trim updates - LP->ULP(5) & LP->ULP(7) */
            /* LP->ULP(5) */
            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_606);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_606);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_606);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_606);

