zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v4.c
            Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_61D);
            Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_61D);

            Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_C);

            /* LP->ULP(6) */
            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_607);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_607);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_607);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_607);

            /* LP->ULP(7) */
            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_603);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_603);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_603);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_603);

            /* 7) M33 send IPC to m0seccpuss - Voltage at target level */
            //TBD

            /* 8) Change RRAM to ULP mode  */
            /* Moved to callback */

            /* 9) Change Frequency  */
            /* Frequency Change needs to be done after calling this API */

            /* 10) M33 sends IPC to m0seccpuss - Frequency at target level */
            //TBD
        }
    }

    return retVal;
}

cy_en_syspm_status_t Cy_SysPm_SystemEnterHp(void)
{
    uint32_t interruptState;
    uint32_t cbLpRootIdx = (uint32_t) CY_SYSPM_HP;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* Call the registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter
    */
    if (pmCallbackRoot[cbLpRootIdx] != NULL)
    {
        retVal = Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_CHECK_READY);
    }

    /* The system can switch into LP only when
    * all executed registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter return CY_SYSPM_SUCCESS
    */
    if (retVal == CY_SYSPM_SUCCESS)
    {

        /* Call the registered callback functions with the
        * CY_SYSPM_BEFORE_TRANSITION parameter
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if (pmCallbackRoot[cbLpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_BEFORE_TRANSITION);
        }

        if(Cy_SysPm_IsSystemLp())
        {
           (void) Cy_SysPm_SystemEnterLpToHp();
        }
        else if(Cy_SysPm_IsSystemUlp())
        {
            (void) Cy_SysPm_SystemEnterUlpToLp();
            (void) Cy_SysPm_SystemEnterLpToHp();
        }
        else
        {
            /*Block added to avoid MISRA errors */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call the registered callback functions with the
        * CY_SYSPM_AFTER_TRANSITION parameter
        */
        if (pmCallbackRoot[cbLpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_AFTER_TRANSITION);
        }
    }
    else
    {
        /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
        * undo everything done in the callback with the CY_SYSPM_CHECK_READY
        * parameter
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_CHECK_FAIL);
        retVal = CY_SYSPM_FAIL;
    }

    return retVal;
}


cy_en_syspm_status_t Cy_SysPm_SystemEnterUlp(void)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    uint32_t cbUlpRootIdx = (uint32_t) CY_SYSPM_ULP;

    /* Call the registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter
    */
    if (pmCallbackRoot[cbUlpRootIdx] != NULL)
    {
        retVal = Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_CHECK_READY);
    }

    /* The system can switch into the ULP only when
    * all executed registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter return CY_SYSPM_SUCCESS
    */
    if (retVal == CY_SYSPM_SUCCESS)
    {
        /* Call the registered callback functions with the
        * CY_SYSPM_BEFORE_TRANSITION parameter
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_BEFORE_TRANSITION);
        }

        if(Cy_SysPm_IsSystemLp())
        {
           (void) Cy_SysPm_SystemEnterLpToUlp();
        }
        else if(Cy_SysPm_IsSystemHp())
        {
           (void) Cy_SysPm_SystemEnterHpToLp();
           (void) Cy_SysPm_SystemEnterLpToUlp();
        }
        else
        {
           /*Block added to avoid MISRA errors */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call the registered callback functions with the
        * CY_SYSPM_AFTER_TRANSITION parameter
        */
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_AFTER_TRANSITION);
        }
    }
    else
    {
        /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
        * undo everything done in the callback with the CY_SYSPM_CHECK_READY
        * parameter
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_CHECK_FAIL);
        retVal = CY_SYSPM_FAIL;
    }

    return retVal;
}


cy_en_syspm_status_t Cy_SysPm_SystemEnterLp(void)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    uint32_t cbUlpRootIdx = (uint32_t) CY_SYSPM_LP;

    /* Call the registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter
    */
    if (pmCallbackRoot[cbUlpRootIdx] != NULL)
    {
        retVal = Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_CHECK_READY);
    }

    /* The system can switch into the ULP only when
    * all executed registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter return CY_SYSPM_SUCCESS
    */
    if (retVal == CY_SYSPM_SUCCESS)
    {
        /* Call the registered callback functions with the
        * CY_SYSPM_BEFORE_TRANSITION parameter
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_BEFORE_TRANSITION);
        }

