zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v4.c
        if(Cy_SysPm_IsSystemHp())
        {
           (void) Cy_SysPm_SystemEnterHpToLp();
        }
        else if(Cy_SysPm_IsSystemUlp())
        {
           (void) Cy_SysPm_SystemEnterUlpToLp();
        }
        else
        {
            /*Block added to avoid MISRA errors */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call the registered callback functions with the
        * CY_SYSPM_AFTER_TRANSITION parameter
        */
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_AFTER_TRANSITION);
        }
    }
    else
    {
        /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
        * undo everything done in the callback with the CY_SYSPM_CHECK_READY
        * parameter
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_CHECK_FAIL);
        retVal = CY_SYSPM_FAIL;
    }

    return retVal;
}


uint32_t Cy_SysPm_ReadStatus(void)
{
    uint32_t pmStatus = 0UL;

    /* Check whether the device is in ULP/LP/HP mode by reading
    *  the core buck profile:
    *  - 0.7V (nominal) - System ULP mode
    *  - 0.8V (nominal) - System LP mode
    *  - 0.9V (nominal) - System HP mode
    */

    /* Read current active regulator */
    /* Current active regulator is LDO */
    if (Cy_SysPm_CoreBuckGetProfile() == CY_SYSPM_CORE_BUCK_PROFILE_LP)
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_LP;
    }
    else if (Cy_SysPm_CoreBuckGetProfile() == CY_SYSPM_CORE_BUCK_PROFILE_ULP)
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_ULP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_HP;
    }

    /* Check whether CM33 is in the deep sleep mode*/
    if((0u != _FLD2VAL(MXCM33_CM33_STATUS_SLEEPING, MXCM33_CM33_STATUS)) &&
       (0u != _FLD2VAL(MXCM33_CM33_STATUS_SLEEPDEEP, MXCM33_CM33_STATUS)))
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM33_DEEPSLEEP;
    }
    /* Check whether CM33 is in the sleep mode*/
    else if (0u != _FLD2VAL(MXCM33_CM33_STATUS_SLEEPING, MXCM33_CM33_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM33_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM33_ACTIVE;
    }

    /* Check whether CM55 is in the deep sleep mode*/
    if((0u != _FLD2VAL(MXCM55_CM55_STATUS_SLEEPING, MXCM55_CM55_STATUS)) &&
       (0u != _FLD2VAL(MXCM55_CM55_STATUS_SLEEPDEEP, MXCM55_CM55_STATUS)))
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM55_DEEPSLEEP;
    }
    /* Check whether CM33 is in the sleep mode*/
    else if (0u != _FLD2VAL(MXCM55_CM55_STATUS_SLEEPING, MXCM55_CM55_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM55_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM55_ACTIVE;
    }

    return pmStatus;
}

bool Cy_SysPm_Cm33IsActive(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM33_ACTIVE) != 0u);
}

bool Cy_SysPm_Cm33IsSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM33_SLEEP) != 0u);
}

bool Cy_SysPm_Cm33IsDeepSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM33_DEEPSLEEP) != 0u);
}

bool Cy_SysPm_Cm55IsActive(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM55_ACTIVE) != 0u);
}

bool Cy_SysPm_Cm55IsSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM55_SLEEP) != 0u);
}

bool Cy_SysPm_Cm55IsDeepSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM55_DEEPSLEEP) != 0u);
}


#endif /* CY_IP_MXS22SRSS */
/* [] END OF FILE */
